---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallBaseHeightParam
source: html/6405f73a-8f69-3d4c-2c7c-6bb3359cd0be.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallBaseHeightParam Property

"Base height"

## Syntax (C#)
```csharp
public static ForgeTypeId WallBaseHeightParam { get; }
```